{"_id":{"$oid":"5b4fe1606e349520f1ed3be6"},"description":"President Donald Trump said on Wednesday he holds his Russian counterpart Vladimir Putin personally responsible for Moscow's attempts to interfere in the 2016 US election.","author":"Kevin Liptak, CNN","url":"http://us.cnn.com/2018/07/18/politics/trump-putin-election-interference/index.html","text":"Trump's views surrounding election meddling have been repeatedly called into question. As recently as this week -- immediately after his one-on-one meeting with Putin -- Trump appeared to believe Putin's denial over the US intelligence community's conclusion that Russia interfered in the 2016 election.Trump ultimately walked back the answer he gave at the joint news conference in Helsinki, and attributed his comments to a simple mistake.\"In a key sentence in my remarks I said the word 'would' instead of 'wouldn't,'\" Trump said on Tuesday. He explained he had reviewed a transcript and video of his remarks.\"The sentence should have been: 'I don't see any reason why it wouldn't be Russia,' \" he said. \"Sort of a double negative.\"The White House was once again sent into clean-up mode Wednesday when Trump said \"no\" when a reporter asked him if Russia was still targeting the United States. Press secretary Sarah Sanders later claimed Trump was saying \"no\" to answering questions, not to whether the Russians are targeting the US.When pressed in his Wednesday interview on whether his acceptance of the US intelligence analysis meant that he thought Putin lied when denying any Russian involvement, Trump said he \"didn't want to get into whether or not he's lying.\" \"I can only say that I do have confidence in our intelligence agencies as currently constituted,\" Trump said. He said his message to Putin warning against future interference was \"very strong\" during their meeting Monday.\"I let him know we can't have this. We're not going to have it. And that's the way it's going to be,\" Trump said.Trump also said once again that he wants to sit down for an interview with special counsel Robert Mueller. Mueller is leading the investigation into Russian interference in the election and Russians' ties to the Trump campaign. \"I've always wanted to do an interview, because look, there's been no collusion,\" Trump said. ","title":"Trump says he holds Putin responsible for election interference","publishedAt":{"$date":"2018-07-19T00:53:25.000Z"},"source":"cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/180717153233-02-donald-trump-0717-super-tease.jpg","class":"Politics \u0026 Government","digest":"Q4sZgIoYUXK2dw9PyiafGQ==\n"}
{"_id":{"$oid":"5b4fe1616e349520f1ed3be9"},"description":"In an interview with CBS, President Trump refused to discuss whether he believed Russian President Vladimir Putin lied to him about interfering in the 2016 presidential election.","author":null,"url":"http://us.cnn.com/videos/politics/2018/07/18/trump-russia-putin-is-he-lying-question-cbs-sot-tsr-vpx.cnn","text":"","title":"Trump: I don't want to get into whether Putin lied - CNN Video","publishedAt":{"$date":"2018-07-19T00:53:25.000Z"},"source":"cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/180718191723-trump-cbs-alternate-image-super-tease.jpg","class":"Politics \u0026 Government","digest":"Nkg2i7guZqjxQEvZO9TRoA==\n"}
{"_id":{"$oid":"5b4fe1626e349520f1ed3bec"},"description":"The White House denied that President Trump doesn't believe Russia is targeting the United States. Press secretary Sarah Sanders, who said she spoke with Trump about his answer earlier during a Cabinet meeting, said the President was declining to answer shouted questions when he said \"no\" to a question about Russia's current efforts.","author":null,"url":"http://us.cnn.com/videos/politics/2018/07/18/sarah-sanders-white-house-press-briefing-trump-russia-targeting-response-sot-vpx.cnn","text":"","title":"Sanders denies Trump said Russia not targeting US - CNN Video","publishedAt":{"$date":"2018-07-19T00:53:25.000Z"},"source":"cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/180718144136-sanders-weds-brief-2-super-tease.jpg","class":"Entertainment","digest":"NlVCLPy3W51ZcwyCBWu4pg==\n"}
{"_id":{"$oid":"5b4fe1636e349520f1ed3bef"},"description":"FBI Director Christopher Wray said Wednesday that Russia “continues to engage in malign influence operations to this day.”","author":null,"url":"https://www.cnn.com/politics/live-news/trump-today-07-18-18/h_707efced99448247ae552cd55a1f9231","text":"","title":"Live: President Trump today - CNNPolitics","publishedAt":{"$date":"2018-07-18T21:38:50.000Z"},"source":"cnn","urlToImage":"https://dynaimage.cdn.cnn.com/cnn/livestory/org/0da8b5df-93eb-4af5-894e-058800d424d7.jpg","class":"Entertainment","digest":"Au7c6QvyJ98eVW31MHvd6w==\n"}
{"_id":{"$oid":"5b4fe1646e349520f1ed3bf2"},"description":"Russian President Vladimir Putin wants to interrogate one of his most vocal critics, Bill Browder, who championed the Magnitsky Act, legislation that imposed US sanctions on Russia. Browder says President Trump calling the proposal an \"interesting idea\" is \"absurd.\"","author":null,"url":"http://us.cnn.com/videos/politics/2018/07/18/bill-browder-absurd-putin-trump-proposal-vpx.cnn","text":"","title":"Browder: WH entertaining Putin proposal 'absurd' - CNN Video","publishedAt":{"$date":"2018-07-19T00:53:25.000Z"},"source":"cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/180717133058-04-trump-putin-summit-0716-opinion-super-tease.jpg","class":"Economic \u0026 Corp","digest":"h1ONPas/iTpa3/aHhSP0Fw==\n"}
{"_id":{"$oid":"5b4fe1656e349520f1ed3bf5"},"description":"Jake Laperruque and Paul Rosenzweig write that states need to prepare for the worst to prevent hacking, fraud, and ballot tampering at the polls in 2018 and 2020.","author":"Jake Laperruque and Paul Rosenzweig","url":"http://us.cnn.com/2018/07/18/opinions/securing-our-next-election-against-hacking-leperruque-rosenzweig/index.html","text":"Jake Laperruque is Senior Counsel for the nonpartisan Constitution Project at the Project On Government Oversight, which seeks bipartisan solutions to constitutional law questions. Paul Rosenzweig is a Senior Fellow at the libertarian R Street Institute. The opinions expressed in this commentary are those of the authors. View more opinion articles on CNN.There are a range of measures to improve election security that states should undertake immediately to protect voter rolls. These include regular and independent backups, conducting audits to confirm tampering has not occurred, advanced training for staff with access to registration databases, building firewalls between personal and office electronic activities, and requiring many layers of authentication before a person is permitted access to a voter database.States should also proactively consider measures that aren't directly designed to protect against an attack on voter rolls but could effectively prevent or mitigate harms. A select number of states maintain decentralized registration databases, which could make a major attack much harder. It's worth further analysis to assess whether decentralization would be an effective countermeasure, and any trade-offs of such an action. Another possible measure is election day registration that would allow anyone purged from rolls to simply re-register. But presently, states with election day registration typically expect a small number of new registrants at polls. Before pursuing such a policy to counter an attack on voter rolls, states need to seriously examine capabilities to handle requests on a larger scale (as would likely follow a major cyberattack on voter rolls). Third, early voting and mail-in voting could provide a timely \"warning\" for individuals who expected to be on voter rolls but were removed by a cyberattack. Some states already provide these options (Oregon, Washington, and Colorado hold all-mail elections, and California will institute the practice starting this year), but these systems were designed to add convenience, not serve as a large-scale remedy for a cyberattack on our election system. We need to determine how these systems would fare in an emergency situation, what challenges would emerge, and what other effects need to be expected and accounted for.One final ominous but critical measure that all states need to undertake: Prepare for the worst. Part of good planning for both cybersecurity and elections is anticipating contingencies. It might be unpleasant, but entities overseeing elections should have plans for what to do next if a major attack succeeds. Election officials should \"war game\" the effectiveness of their current planned responses. For example, provisional ballots are a common backstop when individuals face problems casting a ballot, but they are typically used by only a small number of individuals (generally between 1 and 2%). Could they be effective if deployed for a major portion of all voters? If not, what changes need to be implemented to make such a measure effective? States should also consider broadening laws that permit it to respond to public security emergencies, to account for attacks on their election systems.  These types of laws can sometimes provide added flexibility to respond to unanticipated events.   Finally, we need more poll workers, and we need to ensure that everyone taking on this role is well-trained. Poll workers are the foot soldiers of functional elections. Election boards need to make sure that they have enough well-trained individuals on hand to effectively respond to a crisis. The litany of items to undertake and policies to carefully examine in augmenting election security may be daunting, but it is a necessary undertaking, and with a broad and vigilant set of stakeholders involved, ensuring election security is a goal we can achieve. Our democracy depends on it.","title":"How to secure US elections from future hacking","publishedAt":{"$date":"2018-07-19T00:53:25.000Z"},"source":"cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/161101110356-silicon-valley-election-cyber-hack-super-tease.jpg","class":"Politics \u0026 Government","digest":"zi31T/6nu0VGl3opYx5uTA==\n"}
{"_id":{"$oid":"5b4fe1666e349520f1ed3bf8"},"description":"A Republican congressman from Minnesota has a long history of making deeply misogynistic comments on the radio, including lamenting that women can no longer be called \"sluts.\"","author":"Andrew Kaczynski, Chris Massie and Nathan McDermott, CNN","url":"http://us.cnn.com/2018/07/18/politics/kfile-jason-lewis/index.html","text":"Lewis can be heard on the radio repeatedly demeaning women, and particularly women voters, in 15 months of audio provided to KFile by Michael Brodkorb, the former deputy chair of the Republican Party of Minnesota. Brodkorb, who is currently a columnist for the MinnPost and works in public affairs, initially revealed some of Lewis' radio comments in a column in February 2016. KFile contacted Brodkorb after seeing his 2016 column and requested raw audio files of Lewis' show, which he provided.When radio host Rush Limbaugh called women's rights activists and then-graduate student Sandra Fluke \"a slut\" in February 2012, Lewis repeatedly expressed disbelief that people could no longer refer to women as sluts. \"Well, the thing is, can we call anybody a slut? This is what begs the question. Take this woman out of it, take Rush out of it for a moment,\" Lewis said in a March 2012 episode. \"Does a woman now have the right to behave -- and I know there's a double standard between the way men chase women and running and running around -- you know, I'm not going to get there, but you know what I'm talking about. But it used to be that women were held to a little bit of a higher standard. We required modesty from women. Now, are we beyond those days where a woman can behave as a slut, but you can't call her a slut?\"Fluke, a law student at Georgetown at the time, found herself at the center of a national controversy in early 2012 after Limbaugh attacked her following her testimony to a Democratic congressional group. In her testimony, Fluke said that students paid as much as $1,000 a year for contraceptives and made the case that religious institutions should cover birth control. She said she was \"stunned\" and \"outraged\" by Limbaugh's remarks.Lewis, who was a regular fill-in for Limbaugh's national radio show, also offered a defense of the right-wing radio host for his comments on Fluke, saying, \"Now Limbaugh's reasoning was, look, if you're demanding that the taxpayers pay for your contraception, you must use a lot of them and therefore, ergo, you're very sexually active and in the old days, what we used to call people who were in college or even graduate school who were sexually active, we called them sluts.\"He continued, \"Especially if you want somebody to pay for it. Now you know, obviously that's a stretch. It was meant as an aspect of entertainment radio.\"He continued, \"But have we really got to the point where you can't refer to Madonna as a slut without being sued? I mean, Madonna has had a series of lovers, as have many in Hollywood. Now in the old days, what did we call this? Madonna dresses up in these sorts of prostitute-like outfits on stage, and she goes there and she sings and she shows half of her body. What did we call those people? 30 years ago? 40 years ago? 50 years ago? You can't do that today, it's too politically incorrect?\"Lewis, during a December 2012 segment on changes in the culture, said, \"Only we can tell our young women, 'don't look like some slut and you won't get hit on.'\"In a statement, Lewis' campaign defended his comments. \"This has all been litigated before, and as Congressman Lewis has said time and time again, it was his job to be provocative while on the radio,\" Lewis' campaign manager Becky Alery said in a statement.Lewis' time as a radio show host initially came under scrutiny during the 2016 campaign. In addition to Brodkorb's column, The Atlantic magazine dubbed Lewis Minnesota's \"Mini Trump\" in an article that reviewed a sampling of comments he made about women and minorities, including a comment in which he called young female voters \"ignorant of the important issues in life\" who needed to be educated.Lewis' shocking comments from his show flew under the radar at the time, and some of his most inflammatory comments about women, including his views on the term \"slut,\" were never previously reported. Minnesota Democrats called on Lewis to release his full radio show archive, but he dismissed their demands a \"distraction\" and claimed his comments would be taken \"out of context.\"Echoing comments reported by Brodkorb and The Atlantic, Lewis on several more occasions described women voters as guided by emotion instead of reason and said they voted solely on the issue of free birth control. Lewis at times seemingly confused the kinds of birth control covered by health insurance policies. On an August 2012 show, Lewis speculated that then-President Barack Obama led with women because of this.\"To the degree that the Republicans or conservatives or Mitt Romney has an issue with the women, maybe it isn't Mitt Romney or his positions. Maybe it's the women,\" Lewis said. \"We all know that women tend to vote more liberal than men. It is the women who are guided by more emotion than reason. 'Oh, here we go, stereotyping, stereotyping females once again. What are you doing?' Well, I'm not running for anything. I'm just making an observation.\"He added, \"One of the reasons that the Democrats love the quote unquote female issue is because they know women vote more liberally than men do. Now you could say in a very, very sexist, misogynistic way that, 'well, that's because women just don't understand money. They don't understand, they're, they don't handle finances. They're guided by emotion not reason. Why, that's why they didn't have the vote for a full century in the country.' Well, it is true that women cast more votes for Democrats. All I'm saying, I'm not validating the stereotype. I'm married to a woman for heaven's sakes, but I will say this: Do not, do not pander and move left to get the female vote.\"In a November 2012 broadcast, Lewis said women, by voting for Democrats, played into the stereotype that they don't think.\"So there is something here going on with women who are playing into that stereotype that they're not thinking,\" he said. \"Oh, 'I know that's awfully prejudicial because the only way you can think is it a vote Republican, Jason.' I'm not saying voting Republican, but when you reliably almost a knee-jerk Democrat vote -- is birth control really that important to you ladies? Is that really the most important thing that you get your condoms for free? Now you've gotten Madonna, you know, running around and slutty outfits and Sandra Fluke telling everybody I'm not going to pay a dime for my diaphragm. Is that really what's important to women? I can't believe that. And yet there's this gender gap every election cycle. Women go Democrat.\"The next day, Lewis argued that \"young single women\" who voted based on coverage of birth control pills had ceased to be human beings.\"You can be bought off for that?\" he said. \"I mean, boy, that's the, all the other issues: the Hispanic problem, social issues, class warfare, you know, we can figure out a way to tackle those. This one, if you're that far down the road and you say you're a human being, I've got my suspicions. You're not, you're without a brain. You have no, you have no cognitive function whatsoever. If that's all it takes to buy you off.\"Representatives for Madonna did not return a request for comment. In a statement to CNN, Fluke said, \"Jason Lewis' attitude toward the women of his district and this country is incredibly insulting and beneath any member of the United States Congress. Americans stood with me and resoundingly rejected such uncivil and demeaning attacks from public figures back in 2012. Since then, the brave women of the #MeToo movement have again reminded all of us that disparaging women with insults like 'slut\" and \"parasite,' is an attempt to silence them from speaking up and fighting for comprehensive healthcare they can afford.\"In a September 2012 broadcast, Lewis again returned to Fluke, misrepresenting her testimony, saying, \"If I'm Sandra Fluke, and I say, 'I don't want to pay for my condoms, I want you to pay for them,' that has nothing to do with insurance. That's first dollar, prepaid medicine. It's that's going to jack up the cost for everybody. It's not insurance for a catastrophic event. She is a parasite. I'm not going to call her a slut, but I will call her a parasite.\"","title":"A GOP congressman once lamented not being able to call women 'sluts' anymore","publishedAt":{"$date":"2018-07-19T00:53:25.000Z"},"source":"cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/180718122854-rep-jason-lewis-super-tease.jpg","class":"Economic \u0026 Corp","digest":"3jdHvbtiAIyZ2NCrT6quFA==\n"}
{"_id":{"$oid":"5b4fe1676e349520f1ed3bfb"},"description":"James Clapper, former Director of National Intelligence, reacts to President Donald Trump slamming former members of the intelligence community.","author":null,"url":"http://us.cnn.com/videos/politics/2018/07/18/trump-cbs-2-us-intelligence-agencies-tsr-sot-vpx.cnn","text":"","title":"Trump: Brennan is a total low-life  - CNN Video","publishedAt":{"$date":"2018-07-19T00:53:25.000Z"},"source":"cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/180718184922-02-trump-cbs-clip-super-tease.jpg","class":"Politics \u0026 Government","digest":"rg1qvK9MS4c9HdMPSrCGqw==\n"}
{"_id":{"$oid":"5b4fe1686e349520f1ed3bfe"},"description":"A longtime Ohio GOP official abruptly resigned Monday over President Donald Trump's comments during a news conference in Helsinki at a summit with Russian President Vladimir Putin, saying \"something snapped\" during the conference.","author":"Marc Rod, CNN","url":"http://us.cnn.com/2018/07/18/politics/chris-gagin-republican-ohio-resign-trump-putin-cnntv/index.html","text":"\"I thought that my only recourse, my duty as my conscience told me, was that I needed to simply resign because I could not in effect be the front man for the President here in Belmont County,\" Gagin said Wednesday.Gagin added that he is still a Republican and has no plans to leave the party, and he discouraged others who are dissatisfied with Trump from leaving the party and backing Democrats, as some prominent conservatives have done recently.\"I honestly don't think that's the right thing to do,\" he said, \"because it's important for the Republicans to have that larger conversation within the family.\"Gagin also cautioned that Trump should be wary of alienating conservatives who are not part of his core base.\"I don't have any illusions that my resignation's going to change the base. It's not,\" he said. \"What I think national Republicans have to think about is if you have moderate to establishment Republicans, and certainly those on the independent side that have conservative views, if the President starts to lose us, and I'm not saying that's where it is at the moment ... then the base alone's not going to be enough to carry him through.\"Gagin said he does not regret voting for Trump in 2016 -- citing the President's Supreme Court nominees, Neal Gorsuch and Brett Kavanaugh, as highlights -- but that he may not vote for him in 2020.\"I think we're going to have to see how the rest of this plays out, quite honestly,\" Gagin said.","title":"Longtime Ohio GOP official quits over Trump's news conference with Putin","publishedAt":{"$date":"2018-07-19T00:53:25.000Z"},"source":"cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/180717133058-04-trump-putin-summit-0716-opinion-super-tease.jpg","class":"Economic \u0026 Corp","digest":"qGZcgBJi0L4hJxKd1QZuWA==\n"}
{"_id":{"$oid":"5b4fe1696e349520f1ed3c01"},"description":"Beck Dorey-Stein, a former White House stenographer, says if President Trump wants to fight fake news, he would have a stenographer present and a transcript ready.","author":null,"url":"http://us.cnn.com/videos/politics/2018/07/18/beck-dorey-stein-former-white-house-stenographer-trump-newday-vpx.cnn","text":"","title":"Ex-Trump stenographer on Trump's vulnerability - CNN Video","publishedAt":{"$date":"2018-07-19T00:53:25.000Z"},"source":"cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/180718073054-beck-dorey-stein-former-white-house-stenographer-1-super-tease.jpg","class":"Entertainment","digest":"OI+r+pDEuXhob76c7R9odQ==\n"}
{"_id":{"$oid":"5b50f47cf4b903233d08ef87"},"description":"CNN's Anderson Cooper reacts to President Trump's shifting comments following his summit with Russian President Vladimir Putin.","author":null,"url":"http://us.cnn.com/videos/politics/2018/07/19/trump-no-russia-meddling-kth-ac360-short-vpx.cnn","text":"","title":"Cooper imitates Trump's 'no' moment - CNN Video","publishedAt":{"$date":"2018-07-19T20:27:26.000Z"},"source":"cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/180719034708-anderson-cooper-2-kth-071818-super-tease.jpg","class":"Entertainment","digest":"1xPQozwTbtaicGLWyd2nMw==\n"}
{"_id":{"$oid":"5b50f47ef4b903233d08ef8a"},"description":"Veteran journalist Carl Bernstein comments on President Donald Trump's CBS interview in which he once again denied any Russian collusion in the 2016 US presidential election.","author":null,"url":"http://us.cnn.com/videos/politics/2018/07/19/donald-trump-putin-russia-cbs-interview-ac360-sot-vpx.cnn","text":"","title":"Toobin reacts to Trump's CBS interview - CNN Video","publishedAt":{"$date":"2018-07-19T20:27:26.000Z"},"source":"cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/180718211148-toobin-7-18-super-tease.jpg","class":"Entertainment","digest":"ZZKNm8DkTbJ604am06P60w==\n"}
{"_id":{"$oid":"5b50f480f4b903233d08ef8d"},"description":"There are exactly 838 days between today and November 3, 2020 aka Election Day. That's 2 years, 3 months and 15 days.","author":"Analysis by Chris Cillizza and Harry Enten, CNN","url":"http://us.cnn.com/2018/07/19/politics/2020-democrats-rankings/index.html","text":"If the Iowa caucus -- the kickoff of the presidential voting season -- is held on the same date it was in 2016 (Feb. 1), we are only 18 months from the first vote.One candidate -- Maryland Rep. John Delaney -- has already officially announced his 2020 candidacy.Top-tier potential candidates -- from Joe Biden to Elizabeth Warren to Bernie Sanders -- have been traveling the country, stopping in key states like Iowa and New Hampshire to support down-ballot candidates in the 2018 midtermsPolling is already being done -- both nationally and in early voting states like New Hampshire -- to gauge the early state of the race.The process of running for president -- given the money a candidate has to raise and the organizations that must be built in early voting states -- is like an iceberg. The bit that pokes its head out of the water is only a very small part of a much larger mass below the surface. We are in the below-the-surface part of the presidential primary fight right now -- and will be for at least the next five months, while the Democratic Party focuses on trying to win back control of the House and Senate. But just because you don't see or hear about everything that's going on doesn't mean it's not happening.Which brings us to our rankings of the 10 men and women most likely -- as of today -- to wind up as the Democratic nominee in 2020. In ranking these candidates, we considered current polling, historic trends and lessons that the 2018 Democratic primaries have taught us. So, we tended to default to early polling leaders. And women. And liberals.Obviously, this list -- just like what Democratic voters are looking for in their candidate -- can and will change between now and when the first ballots are cast.  And we will be there the whole way, releasing updated rankings once a month between now and then. Don't see your favorite candidate? Just wait! Or email us and make an argument for what we missed and why; it's cillizza@cnn.com and harry.enten@cnn.com.Enjoy.10. Sherrod Brown: How do you beat a populist like Trump who triumphed in Midwest? You could nominate a Midwestern populist like this senior senator from Ohio. Brown's liberal record matched with a gravelly voice that seems almost out of central casting could be the ticket for Democrats. Brown, though, has said he has no interest in running (and he's up for re-election to the Senate this fall). At the same time, it's somewhat hard to imagine Democrats nominating a white senator. Especially one with some question marks in his personal history. 9. Mitch Landrieu: If Democrats want an outsider with experience, then there are few people better than this two-term mayor of New Orleans who has never held federal office. As mayor, he removed Confederate monuments. Being mayor of a majority black city in a party that has a substantial black voting bloc and is becoming more urban could also pay off big. Yet, even with Trump in the White House, it's tough to imagine that a little-known mayor could win a major party nomination. Especially one with some potholes in his record. 8. Cory Booker: In what is shaping up to be a big field, Booker will have little difficulty generating press. He's been doing that since a documentary was made about his first run for mayor of Newark (It's a great documentary). Democrats also have a history of nominating first full-term black senators who have recently given a big Democratic National Convention speech. Want to know why Booker isn't higher? Google \"Cory Booker\" and \"neo-liberal.\" Booker may have a major issue with the left intelligentsia due to his ties to Wall Street.7. Steve Bullock: Bullock, if you don't know, is the two-term governor of Montana. That's a big part of Bullock's challenge; if he runs he will take on a whole bunch of candidates who are already known nationally. He is, well, not. But the party's growth in the West -- and the success of governors as presidential candidates -- means that a governor from this part of the country seems likely to emerge. Bullock looks best positioned to be that guy right now. He's been traveling to early voting states to lay the groundwork and refine a message about why -- and how -- Democrats need to expand their tent.6. Eric Holder: The name of the former attorney general was on almost no one's lists at the start of 2018. But he's made clear in both his travel and his rhetoric of late that he is seriously open to running for president. In June, Holder acknowledged that running for president in 2020 is \"\"something that I'm considering.\" And he's already got a schtick against Trump; \"Two guys from Queens,\" Holder said. \"That would be interesting. New Yorkers know how to talk to other New Yorkers.\" Holder would likely be seen as former President Barack Obama's favorite in the race given the duo's long friendship. Presumably that is a good thing in the context of a Democratic primary.5. Bernie Sanders: Sanders is one of the most beloved politicians within the Democratic Party (even though he's not technically a Democrat), with strong favorable ratings. He's a proven vote-getter in presidential primaries (earning 43% of the 2016 Democratic primary vote). And in a party that is shifting left, Sanders was left before it was cool. So why is Sanders not higher? He's a white male, and Democrats may be looking to turn the page from 2016. Do Democrats really want another primary in which they have to argue about whether one of the major candidates is actually a Democrat or an independent? 4. Kirsten Gillibrand: There may be no more predictive qualities in Democratic primaries in 2018 than being anti-Trump and being a woman. Gillibrand has both of those qualities. She's voted less with Trump than any other senator. Being from New York will also give a megaphone (see Trump, Donald). Why isn't she higher? Besides the fact that there are other women running, she may have an authenticity problem when that quality seems to be at a premium. Although she is liberal now when it is politically expedient, she was a moderate member of the House.3. Kamala Harris: If Democrats are looking to draw a very sharp contrast with Trump, Harris makes the most sense. The first-term California senator was the first black and first Indian woman elected to the Senate from the Golden State. She comes from a law and order background; she was attorney general of California before running for the Senate. And she's from a massive Democratic donor state -- meaning the money would be there for her if she did decide to run. As to that: Harris' mind seems pretty made up; she's writing a memoir set to publish in 2019, which is a sort of necessary move for someone running for president.2. Elizabeth Warren: Unlike 2016, when the Massachusetts senator was doing nothing to indicate she might run, Warren is making a series of moves that suggest she is a likely entrant in 2020. Warren has already reached out to politicians in Iowa, New Hampshire and South Carolina, according to The New York Times. If Democrats are looking for some sort of compromise candidate between the establishment and the party base, Warren could fit the bill somewhat nicely.  Republicans repeatedly insist she is their ideal general election candidate against Trump, believing that Warren is simply too liberal to possibly win nationally.1. Joe Biden: The former vice president may not seem like the perfect fit for this moment in the Democratic Party -- he's older (75), white, male, and has been in electoral politics for more than four decades. And yet, Biden has something that no other candidate in the field has. First, he's on top of early polls gauging the 2020 field.  He's leading in national polls, early primary state polls and in a matchup against Trump. That's no guarantee Biden wins the nomination -- but if history holds, it's an indicator he'll be right there until the end.","title":"The definitive ranking of 2020 Democrats","publishedAt":{"$date":"2018-07-19T20:27:26.000Z"},"source":"cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/180717145815-20180717-definitive-democrat-rankings-2020-super-tease.jpg","class":"Economic \u0026 Corp","digest":"dIMIFxsJG9/phvoIzE8dVg==\n"}
{"_id":{"$oid":"5b50f481f4b903233d08ef90"},"description":"Listen to why former White House Press Secretary Sean Spicer says he wishes he could have a \"do-over.\"","author":null,"url":"http://us.cnn.com/videos/politics/2018/07/19/sean-spicer-defending-president-trump-falsehoods-nbc-orig-js.cnn","text":"","title":"Does Spicer 'regret' defending Trump? - CNN Video","publishedAt":{"$date":"2018-07-19T20:27:26.000Z"},"source":"cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/180711120106-sean-spicer-super-tease.jpg","class":"Politics \u0026 Government","digest":"L3sFyCGnivc44BUzUJMEdQ==\n"}
{"_id":{"$oid":"5b50f483f4b903233d08ef93"},"description":"The White House withdrew the nomination of Circuit Court hopeful Ryan Bounds on Thursday, moments before the nominee was to face his Senate confirmation vote and after South Carolina Republican Sen. Tim Scott raised concerns.","author":"Phil Mattingly, CNN","url":"http://us.cnn.com/2018/07/19/politics/circuit-court-nominee-ryan-bounds-withdraws/index.html","text":"One source described there was then a \"jail break\" of Republican senators with concerns. Once it was clear the vote was going to go down, several other senators also said they didn't want any part of voting for him, according to the sources, who said calls were made to the White House to let them know.\"The easiest way for me to say what I am trying to articulate is that the information I had was insufficient for me to be a 'yes' vote and therefore I was looking for more information that had not been provided,\" Scott told reporters after the withdrawal. Democrats have long been opposed to Bounds.At issue were controversial writings from his college days that he did not make available to the Oregon judicial screening commission. California Democratic Sen. Dianne Feinstein said that Oregon Democratic Sens. Ron Wyden and Jeff Merkey would not have recommended him if they had known of the writings.Critics say the writings show an insensitivity to racial minorities, among other issues.Senate Judiciary Chairman Chuck Grassley supported him and the Iowa Republican said the views expressed were from years ago. The issue came up during his confirmation hearing, and he expressed regret.\"The President withdrew it and the President has the authority to do that,\" Grassley said.This story is breaking and will be updated.","title":"Circuit Court nomination pulled over racially insensitive writing","publishedAt":{"$date":"2018-07-19T20:27:26.000Z"},"source":"cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/180719145503-01-ryan-bounds-0719-super-tease.jpg","class":"Politics \u0026 Government","digest":"Caa1m9XXcLovLvrdJPjoYg==\n"}
{"_id":{"$oid":"5b50f484f4b903233d08ef96"},"description":"Sen. Lindsey Graham (R-SC) says he's less concerned with the topics President Trump and Russian President Vladimir Putin discussed in private, and more concerned with any agreements the two may have come to.","author":null,"url":"http://us.cnn.com/videos/politics/2018/07/19/lindsey-graham-trump-putin-helsinki-summit-reaction-sot-vpx.cnn","text":"","title":"Graham: Trump won't meet Putin in private again - CNN Video","publishedAt":{"$date":"2018-07-19T20:27:26.000Z"},"source":"cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/180719111935-lindsey-graham-trump-putin-helsinki-summit-reaction-sot-00011509-super-tease.jpg","class":"Entertainment","digest":"A0ptdc4RSfCkUtOBh9JZLw==\n"}
